hatch=[
    "/",  # 斜线
    "\\",  # 反斜线
    "|",  # 垂直线
    "-",  # 水平线
    "+",  # 加号
    "x",  # 乘号
    "o",  # 小圆点
    "O",  # 大圆点
    ".",  # 小点
    "*",   # 星号
    "",  # 无填充
]

markers=[
    "o",  # 圆圈
    "s",  # 正方形
    "D",  # 菱形
    "^",  # 向上的三角形
    "v",  # 向下的三角形
    "<",  # 向左的三角形
    ">",  # 向右的三角形
    "p",  # 五边形
    "*",  # 星形
    "h",  # 六边形1
    "H",  # 六边形2
    "+",  # 加号
    "x",  # 乘号
    "d"   # 细菱形
]

linestyle=[
    "-",  # 实线
    "--",  # 短划线
    "-.",  # 点划线
    ":",  # 虚线
    "dotted",  # 点线
    "dashed",  # 虚线（长划线）
    "None"  # 无线条
]

color=[
    "black",  # 黑色
    "red",  # 红色
    "blue",  # 蓝色
    "green",  # 绿色
    "yellow",  # 黄色
    "purple",  # 紫色
    "cyan",  # 青色
    "magenta"  # 品红色
]

